Revit 2027 API
View.GenLevel Property
The level for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Level GenLevel { get; }
Public ReadOnly Property GenLevel As Level
	Get
public:
property Level^ GenLevel {
	Level^ get ();
}
member GenLevel : Level with get
Property Value
Level
Remarks
This will obtain the level for views related to levels, such as Plan Views. If this View is not generated by a level, this property is null.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace